zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/ke1xz/pinctrl/MKE12Z512VLH9-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE12Z512VLH9/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKE17Z512VLH9-pinctrl.h with this part's differences applied
 * below (47 removed, 0 changed,
 * 11 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 0fc67e9e7f61f0e4
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE12Z512VLH9_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKE12Z512VLH9_WRAPPER_

#include "MKE17Z512VLH9-pinctrl.h"

/* Signals not present on this part */
#undef TSI0_CH0_PTE6
#undef TSI0_CH10_PTE10
#undef TSI0_CH11_PTD1
#undef TSI0_CH12_PTD0
#undef TSI0_CH16_PTE5
#undef TSI0_CH17_PTE4
#undef TSI0_CH18_PTE3
#undef TSI0_CH19_PTD16
#undef TSI0_CH1_PTE2
#undef TSI0_CH20_PTD15
#undef TSI0_CH21_PTE9
#undef TSI0_CH22_PTE8
#undef TSI0_CH23_PTB5
#undef TSI0_CH24_PTB4
#undef TSI0_CH2_PTA13
#undef TSI0_CH3_PTA12
#undef TSI0_CH4_PTA11
#undef TSI0_CH5_PTA10
#undef TSI0_CH6_PTE1
#undef TSI0_CH7_PTE0
#undef TSI0_CH8_PTC5
#undef TSI0_CH9_PTE11
#undef TSI1_CH0_PTC6
#undef TSI1_CH10_PTE7
#undef TSI1_CH11_PTA6
#undef TSI1_CH12_PTA7
#undef TSI1_CH13_PTC8
#undef TSI1_CH14_PTC9
#undef TSI1_CH15_PTB0
#undef TSI1_CH16_PTB1
#undef TSI1_CH17_PTB2
#undef TSI1_CH18_PTB3
#undef TSI1_CH19_PTC14
#undef TSI1_CH1_PTC7
#undef TSI1_CH20_PTC15
#undef TSI1_CH21_PTC16
#undef TSI1_CH22_PTC17
#undef TSI1_CH23_PTC0
#undef TSI1_CH24_PTC1
#undef TSI1_CH2_PTA0
#undef TSI1_CH3_PTA1
#undef TSI1_CH4_PTA2
#undef TSI1_CH5_PTA3
#undef TSI1_CH6_PTD2
#undef TSI1_CH7_PTD4
#undef TSI1_CH8_PTB12
#undef TSI1_CH9_PTB13

/* Signals specific to this part */
#define FTM0_FLT0/TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,2)
#define TRGMUX_IN4_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3 KINETIS_MUX('D',3,6)
#define TRGMUX_IN5_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2 KINETIS_MUX('D',2,6)
#define TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,6)
#define TRGMUX_IN7_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5 KINETIS_MUX('D',5,6)
#define TRGMUX_OUT0_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1 KINETIS_MUX('A',1,7)
#define TRGMUX_OUT1_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0 KINETIS_MUX('D',0,7)
#define TRGMUX_OUT2_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1 KINETIS_MUX('D',1,7)
#define TRGMUX_OUT3_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0 KINETIS_MUX('A',0,7)
#define TRGMUX_OUT4_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10 KINETIS_MUX('E',10,7)
#define TRGMUX_OUT5_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11 KINETIS_MUX('E',11,7)

#endif /* _ZEPHYR_DTS_BINDING_MKE12Z512VLH9_WRAPPER_ */
